export const 가_CHAR_CODE = '가'.charCodeAt(0) // 한글 첫 단어
export const 힣_CHAR_CODE = '힣'.charCodeAt(0) // 한글 마지막 단어

/**
 * ㄱ -> 'ㄱ'
 * ㄳ -> 'ㄱㅅ' 으로 나눈다.
 */
export const 자음: Record<string, string> = {
    // 종성이 없는 경우 '빈' 초성으로 관리하는 것이 편리하여, 빈 문자열도 포함한다.
    '': '',
    ㄱ: 'ㄱ',
    ㄲ: 'ㄲ',
    ㄳ: 'ㄱㅅ',
    ㄴ: 'ㄴ',
    ㄵ: 'ㄴㅈ',
    ㄶ: 'ㄴㅎ',
    ㄷ: 'ㄷ',
    ㄸ: 'ㄸ',
    ㄹ: 'ㄹ',
    ㄺ: 'ㄹㄱ',
    ㄻ: 'ㄹㅁ',
    ㄼ: 'ㄹㅂ',
    ㄽ: 'ㄹㅅ',
    ㄾ: 'ㄹㅌ',
    ㄿ: 'ㄹㅍ',
    ㅀ: 'ㄹㅎ',
    ㅁ: 'ㅁ',
    ㅂ: 'ㅂ',
    ㅃ: 'ㅃ',
    ㅄ: 'ㅂㅅ',
    ㅅ: 'ㅅ',
    ㅆ: 'ㅆ',
    ㅇ: 'ㅇ',
    ㅈ: 'ㅈ',
    ㅉ: 'ㅉ',
    ㅊ: 'ㅊ',
    ㅋ: 'ㅋ',
    ㅌ: 'ㅌ',
    ㅍ: 'ㅍ',
    ㅎ: 'ㅎ',
}

export const 모음: Record<string, string> = {
    ㅏ: 'ㅏ',
    ㅐ: 'ㅐ',
    ㅑ: 'ㅑ',
    ㅒ: 'ㅒ',
    ㅓ: 'ㅓ',
    ㅔ: 'ㅔ',
    ㅕ: 'ㅕ',
    ㅖ: 'ㅖ',
    ㅗ: 'ㅗ',
    ㅘ: 'ㅗㅏ',
    ㅙ: 'ㅗㅐ',
    ㅚ: 'ㅗㅣ',
    ㅛ: 'ㅛ',
    ㅜ: 'ㅜ',
    ㅝ: 'ㅜㅓ',
    ㅞ: 'ㅜㅔ',
    ㅟ: 'ㅜㅣ',
    ㅠ: 'ㅠ',
    ㅡ: 'ㅡ',
    ㅢ: 'ㅡㅣ',
    ㅣ: 'ㅣ',
}

/**
 * 초성으로 올 수 있는 한글 글자
 */
export const 초성: readonly string[] = [
    'ㄱ',
    'ㄲ',
    'ㄴ',
    'ㄷ',
    'ㄸ',
    'ㄹ',
    'ㅁ',
    'ㅂ',
    'ㅃ',
    'ㅅ',
    'ㅆ',
    'ㅇ',
    'ㅈ',
    'ㅉ',
    'ㅊ',
    'ㅋ',
    'ㅌ',
    'ㅍ',
    'ㅎ',
]

export const 중성: readonly string[] = Object.values(모음)

export const 종성: readonly string[] = [
    '',
    'ㄱ',
    'ㄲ',
    'ㄳ',
    'ㄴ',
    'ㄵ',
    'ㄶ',
    'ㄷ',
    'ㄹ',
    'ㄺ',
    'ㄻ',
    'ㄼ',
    'ㄽ',
    'ㄾ',
    'ㄿ',
    'ㅀ',
    'ㅁ',
    'ㅂ',
    'ㅄ',
    'ㅅ',
    'ㅆ',
    'ㅇ',
    'ㅈ',
    'ㅊ',
    'ㅋ',
    'ㅌ',
    'ㅍ',
    'ㅎ',
].map((consonant) => 자음[consonant])

export type 조사Option = '이/가' | '을/를' | '은/는' | '으로/로' | '와/과' | '이나/나' | '이에/에'
